tutorials/coupled/conjugateHeatSimpleFoam/conjugateHeatedSolid/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p_rgh|p"
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-7;
        relTol           0.01;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          0;
        maxIter          1000;
        tolerance        1e-7;
        relTol           0.01;
    }
    T_T
    {
        solver           BiCGStab;
        preconditioner   Cholesky;

        minIter          0;
        maxIter          1000;
        tolerance        1e-7;
        relTol           0.001;
    }
    G
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          1;
        maxIter          1000;
        tolerance        1e-7;
        relTol           0.1;
    }
    epsilon
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          1;
        maxIter          100;
        tolerance        1e-7;
        relTol           0.01;
    }
    k
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          1;
        maxIter          100;
        tolerance        1e-7;
        relTol           0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    p_rghRefCell        0;
    p_rghRefValue       0;

    pRefCell            0;
    pRefValue           0;
}

relaxationFactors
{
    U               0.7;
    p               0.3;
    p_rgh           0.3;
//     T               0.7;
    k               0.7;
    epsilon         0.7;
}


// ************************************************************************* //
